// config/filter-options.ts

export const CATEGORIES = [
    "Акции и купоны", "Аналитика", "Бизнес", "Видеоигры", 
    "Дом", "Здоровье", "Искусство", "Иностранные языки",
    "Красота", "Криптовалюта", "Лайфхаки", "Маркетинг",
    "Мемы", "Нейросети", "Наука", "Образование", 
    "Обзоры покупок", "Правильное питание", "Путешествия",
    "Политика", "Подкасты", "Программирование", 
    "Саморазвитие", "Фотография"
];

export const SUBSCRIBER_RANGES = [
    { label: "Все", min: 0, max: Infinity },
    { label: "от 1000 до 5000", min: 1000, max: 5000 },
    { label: "от 5000 до 10000", min: 5000, max: 10000 },
    { label: "от 10к до 50к", min: 10000, max: 50000 },
    { label: "от 50к до 100к", min: 50000, max: 100000 },
    { label: "от 100к до 500к", min: 100000, max: 500000 },
    { label: "от 500к до 1млн", min: 500000, max: 1000000 },
    { label: "более 1млн", min: 1000000, max: Infinity },
];