import { SVGProps } from "react"

export const ActiveEye = (props: SVGProps<SVGSVGElement>) => {
    return (
        <svg 
            width="28" 
            height="28" 
            viewBox="0 0 28 28" 
            fill="none" 
            xmlns="http://www.w3.org/2000/svg"
            {...props}
        >
            {/* Убрал opacity="0.9" для четкости, stroke="currentColor" */}
            <path 
                d="M3.71768 17.3626C2.7529 16.1092 2.27051 15.4825 2.27051 13.6216C2.27051 11.7607 2.7529 11.134 3.71768 9.88058C5.64409 7.37786 8.87485 4.54053 13.6219 4.54053C18.3689 4.54053 21.5996 7.37786 23.526 9.88058C24.4908 11.134 24.9732 11.7607 24.9732 13.6216C24.9732 15.4825 24.4908 16.1092 23.526 17.3626C21.5996 19.8654 18.3689 22.7027 13.6219 22.7027C8.87485 22.7027 5.64409 19.8654 3.71768 17.3626Z" 
                stroke="currentColor" 
                strokeWidth="1.7027"
            />
            <path 
                d="M17.0266 13.6216C17.0266 15.5023 15.502 17.027 13.6212 17.027C11.7405 17.027 10.2158 15.5023 10.2158 13.6216C10.2158 11.7408 11.7405 10.2162 13.6212 10.2162C15.502 10.2162 17.0266 11.7408 17.0266 13.6216Z" 
                stroke="currentColor" 
                strokeWidth="1.7027"
            />
        </svg>
    )
}

export const DisactiveEye = (props: SVGProps<SVGSVGElement>) => {
    // Используем тот же код, но цвет будет управляться родителем
    return <ActiveEye {...props} />
}