import { AdvantagesCardItem } from "../types/advantage-card-item";

export const ADVANTAGE_ITEMS: AdvantagesCardItem[] = [
    {
        num: 1,
        color: "#6D5CE8", // Фиолетовый
        text: "Единый договор на все размещения"
    },
    {
        num: 2,
        color: "#3B82F6", // Синий
        text: "Доступ к большинству рекламных площадок Telegram и ВК"
    },
    {
        num: 3,
        color: "#22C55E", // Зеленый
        text: "Цены без наценок — как при работе напрямую"
    },
    {
        num: 4,
        color: "#06B6D4", // Бирюзовый (Cyan)
        text: "Возможность пост-оплаты для постоянных клиентов"
    },
    {
        num: 5,
        color: "#D946EF", // Розовый/Фуксия
        text: "Запуск кампаний в сжатые сроки"
    },
    {
        num: 6,
        color: "#A87556", // Коричневый
        text: "Простота работы и единая точка входа"
    },
    {
        num: 7,
        color: "#6366F1", // Индиго
        text: "Гибкость в сроках, форматах и бюджетах"
    },
    {
        num: 8,
        color: "#EAB308", // Желтый
        text: "Высокая скорость запуска кампаний"
    },
    {
        num: 9,
        color: "#F97316", // Оранжевый
        text: "Огромные возможности по посеву информации"
    },
    {
        num: 10,
        color: "#84CC16", // Светло-зеленый (Lime)
        text: "Работаем с теми, кто ценит результат и контроль"
    }
];